{
  "header": {
    "title": "လူထုစီမံခန့်ခွဲမှုစနစ်"
  },
  "language": {
    "en": "English",
    "my": "မြန်မာ",
    "change": "ဘာသာစကားပြောင်းရန်"
  },
  "login": {
    "title": "သင့်အကောင့်ဝင်ရန်",
    "subtitle": "သင့်အီးမေးလိပ်စာနှင့် စကားဝှက်ကိုရိုက်ထည့်ပြီး အကောင့်ဝင်ပါ",
    "employeeId": "ဝန်ထမ်းအမှတ်",
    "employeeIdPlaceholder": "ဝန်ထမ်းအမှတ်ထည့်ပါ",
    "email": "အီးမေးလိပ်စာ",
    "emailPlaceholder": "နမူနာ@example.com",
    "password": "စကားဝှက်",
    "passwordPlaceholder": "••••••••",
    "rememberMe": "ကျွန်ုပ်ကိုမှတ်ထားပါ",
    "forgotPassword": "စကားဝှက်မေ့နေပါသလား?",
    "signIn": "အကောင့်ဝင်မည်",
    "signingIn": "အကောင့်ဝင်နေပါသည်...",
    "orContinueWith": "သို့မဟုတ် ဆက်လက်လုပ်ဆောင်ရန်",
    "noAccount": "အကောင့်မရှိပါသလား?",
    "signUp": "အကောင့်ဖွင့်ရန်",
    "errors": {
      "employeeIdRequired": "ဝန်ထမ်းအမှတ်ဖြည့်ရန်လိုအပ်ပါသည်",
      "emailRequired": "အီးမေးလိပ်စာဖြည့်ရန်လိုအပ်ပါသည်",
      "invalidEmail": "သင့်အီးမေးလိပ်စာကို မှန်ကန်စွာရေးပေးပါ",
      "passwordRequired": "စကားဝှက်ဖြည့်ရန်လိုအပ်ပါသည်",
      "passwordMinLength": "စကားဝှက်တွင် အနည်းဆုံး စာလုံး ၆ လုံးပါရမည်",
      "invalidCredentials": "အီးမေးလိပ်စာ သို့မဟုတ် စကားဝှက် မှားယွင်းနေပါသည်",
      "unknownError": "အမှားတစ်ခုဖြစ်နေပါသည်။ ကျေးဇူးပြု၍ နောက်မှထပ်ကြိုးစားပါ။"
    },
    "success": "အကောင့်ဝင်မှုအောင်မြင်ပါသည်!"
  },
  "home": {
    "welcome": "HR စီမံခန့်ခွဲမှုစနစ်သို့ ကြိုဆိုပါသည်",
    "features": {
      "title": "အဓိက အင်္ဂါရပ်များ",
      "multilingual": "အင်္ဂလိပ်နှင့်မြန်မာဘာသာစကား အားလုံးအတွက် အပြည့်အဝထောက်ပံ့မှု",
      "userFriendly": "နားလည်ရလွယ်ပြီး အသုံးပြုရလွယ်ကူသော အင်တာဖေ့စ်",
      "efficient": "HR လုပ်ငန်းစဉ်များကို ပိုမိုထိရောက်စွာ စီမံခန့်ခွဲနိုင်မည်"
    },
    "about": {
      "title": "ကျွန်ုပ်တို့၏စနစ်အကြောင်း",
      "description": "သင့်ရဲ့ HR လုပ်ငန်းစဉ်များကို ပိုမိုကောင်းမွန်စွာ စီမံခန့်ခွဲနိုင်ရန် ဒီဇိုင်းထုတ်ထားသော စနစ်တစ်ခုဖြစ်ပါသည်။",
      "learnMore": "အချက်အလက်များပိုမိုသိရှိရန်"
    },
    "currentLanguage": "သင်သည် မြန်မာဘာသာဖြင့် ကြည့်ရှုနေပါသည်",
    "languageNote": "ဘာသာစကားပြောင်းလိုပါက အပေါ်ဘားရှိ ဘာသာစကားပြောင်းခလုတ်ကို နှိပ်ပါ။"
  },
  "employees": {
    "title": "ဝန်ထမ်းများ",
    "addEmployee": "ဝန်ထမ်းအမှတ်ဖြည့်ရန်",
    "employeeList": "ဝန်ထမ်းများစာရင်း",
    "noEmployees": "ဝန်ထမ်းများစာရင်း မရှိပါ",
    "loading": "Loading employees...",
    "error": "Error loading employees"
  }
}
